novelsm/log/count10m/load.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/leveldbjni-binding/conf:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/conf:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/core-0.16.0-SNAPSHOT.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/leveldb-api-0.6.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/leveldbjni-binding-0.16.0-SNAPSHOT.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/novelsmjni.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.LevelDbJniClient -P our-nvm-workloads/workloada -p rocksdb.dir=/mnt/ssd/xiaohu/novelsm -load
Command line: -db com.yahoo.ycsb.db.LevelDbJniClient -P our-nvm-workloads/workloada -p rocksdb.dir=/mnt/ssd/xiaohu/novelsm -load
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
FLAGS_use_existing_db: 0
FLAGS_db_disk: /mnt/ssd/xiaohu/novelsm
FLAGS_db_mem:  /pmem/xiaohu/novelsm
FLAGS_nvm_buffer_size:  67108864
FLAGS_num_levels:  2
FLAGS_num_read_threads:  1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 7071270
[OVERALL], Throughput(ops/sec), 1414.1731259024193
[TOTAL_GCS_PS_Scavenge], Count, 286
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 10072
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.14243551724089165
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 286
[TOTAL_GC_TIME], Time(ms), 10072
[TOTAL_GC_TIME_%], Time(%), 0.14243551724089165
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 36272.0
[CLEANUP], MinLatency(us), 36256
[CLEANUP], MaxLatency(us), 36287
[CLEANUP], 95thPercentileLatency(us), 36287
[CLEANUP], 99thPercentileLatency(us), 36287
[INSERT], Operations, 10000000
[INSERT], AverageLatency(us), 704.6051293
[INSERT], MinLatency(us), 20
[INSERT], MaxLatency(us), 36569087
[INSERT], 95thPercentileLatency(us), 1279
[INSERT], 99thPercentileLatency(us), 1299
[INSERT], Return=OK, 10000000