novelsm/log/count10m/workloadd.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/leveldbjni-binding/conf:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/conf:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/core-0.16.0-SNAPSHOT.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/leveldb-api-0.6.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/leveldbjni-binding-0.16.0-SNAPSHOT.jar:/home/hustzyw/xiaohu/ycsb-leveldbjni-binding-0.16.0/lib/novelsmjni.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.LevelDbJniClient -P our-nvm-workloads/workloadd -p rocksdb.dir=/mnt/ssd/xiaohu/novelsm -t
Command line: -db com.yahoo.ycsb.db.LevelDbJniClient -P our-nvm-workloads/workloadd -p rocksdb.dir=/mnt/ssd/xiaohu/novelsm -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
FLAGS_use_existing_db: 0
FLAGS_db_disk: /mnt/ssd/xiaohu/novelsm
FLAGS_db_mem:  /pmem/xiaohu/novelsm
FLAGS_nvm_buffer_size:  67108864
FLAGS_num_levels:  2
FLAGS_num_read_threads:  1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 322162
[OVERALL], Throughput(ops/sec), 3104.0284080679908
[TOTAL_GCS_PS_Scavenge], Count, 41
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2917
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9054450866334329
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 41
[TOTAL_GC_TIME], Time(ms), 2917
[TOTAL_GC_TIME_%], Time(%), 0.9054450866334329
[READ], Operations, 949641
[READ], AverageLatency(us), 330.9185586974446
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 147839
[READ], 95thPercentileLatency(us), 1558
[READ], 99thPercentileLatency(us), 2429
[READ], Return=OK, 949641
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 17864.0
[CLEANUP], MinLatency(us), 17856
[CLEANUP], MaxLatency(us), 17871
[CLEANUP], 95thPercentileLatency(us), 17871
[CLEANUP], 99thPercentileLatency(us), 17871
[INSERT], Operations, 50359
[INSERT], AverageLatency(us), 104.73633312813996
[INSERT], MinLatency(us), 27
[INSERT], MaxLatency(us), 99071
[INSERT], 95thPercentileLatency(us), 127
[INSERT], 99thPercentileLatency(us), 189
[INSERT], Return=OK, 50359